#이 55개의 변수를 (ax + b) + (ay + b) 이런식으로 표현해서 합쳐서 나온 승률과 실제 승률을 비교해서 a랑b까지 전부 정립하면 어느정도 될법한데?

#또한 한쪽에 있는 변수의 게임수가 다른 거에 비해 매우 낮은 경우가 있으면 빼고 계산할 생각도 해야하고 예를 들어 탑 아이번...

# 근데 문제는 관계도인데, 관계도로 관계도를 정립해야함. 비슷한 챔프에게 강하고 비슷한 챔프에게 약하면 동일관계에 있다고 볼 수 있는데(말파 제이스, 말파 이렐)

#여기서 제이스 이렐은 비슷한 역할임. 물론 제이스는 포킹 이렐은 이니시지만 어쨌든. 근데 제이스랑 이렐이 비슷한 이유는 둘다 말파이트에게 져서임. 근데 예를 들어 피오라.
#피오라나 이렐이나 탱커를 잘잡지만 말파이트는 예외임. 이러면 다르게 분류될수도
# 아니지 진작에 분류를 하는순간 정확도가 떨어짐. %로 하는게 맞음. 예는 이 역할을 %만큼 가지고있다. 이렇게. 왜 %로 하느냐.
#시너지 승률 70이랑 67이랑 별다를거 없다고 판단할거임.

#그러니까 이제 라인별 관계에 따른 승률을 분석하는거임

# 레드정글 - 블루미드 사이의 승률 그래프와 실제 승리, 패배가 얼마나 관계있는가. 근데말야? 카서스-제드의 그래프로 카서스-제드를 분석하면 그대로 가지 않겠냐?
# 어느쪽이 더 극단적인 그래프를 자랑하는가, 는 분석할수 있겠지. 글쎄.
